app/controllers/products_controller.rb

  def edit
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["price", "test"], ["created_at", "2015-08-28 03:12:17.141729"], ["updated_at", "2015-08-28 03:12:17.141729"]]

  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", "$4000"], ["updated_at", "2015-08-28 03:41:15.090663"], ["id", 4]]

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]